Попытка	
Определения = Новый WSОпределения(УзелОбмена.АдресВебСервиса,УзелОбмена.Пользователь,УзелОбмена.Пароль);
Прокси = Новый WSПрокси(Определения, Определения.Сервисы[0].URIПространстваИмен,Определения.Сервисы[0].Имя,Определения.Сервисы[0].ТочкиПодключения[0].Имя);
Прокси.Пользователь = УзелОбмена.Пользователь;
Прокси.Пароль       = УзелОбмена.Пароль;	
Исключение	
Возврат Ложь;
КонецПопытки;

ТипПараметра = Прокси.ФабрикаXDTO.Тип(“http://www.w3.org/2001/XMLSchema”,“string”);
Данные = Прокси.ФабрикаXDTO.Создать(ТипПараметра,СтрокаДжейсон);
Ответ = Прокси.SetData(Данные);