//Открываем стандартный диалог Windows выбора каталога/файла в режиме выбора каталога - ДиалогВыбораФайла 1С
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);

//Если пользователь не нажал кнопку ОТМЕНА в диалоге
Если Диалог.Выбрать() Тогда
     ИмяКаталога = Диалог.Каталог;
КонецЕсли;

Сообщить(ИмяКаталога);


////////////////////////////////////////////////////////////////////////////////////////////
//Открываем стандартный диалог Windows выбора каталога/файла в режиме выбора файла на сохранение - ДиалогВыбораФайла 1С
Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
//каталог по-умолчанию, можно не указывать
Диалог.Каталог = "C:\";
//фильтр для одного вида файлов, для нескольких – см. следующий пример
Диалог.Фильтр = "Текстовый файл (*.txt)|*.txt|";

//Если пользователь не нажал кнопку ОТМЕНА в диалоге
Если Диалог.Выбрать() Тогда
     //Полное имя файла – с учетом «пути к нему» (имени каталога к нему)
     ИмяФайла = Диалог.ПолноеИмяФайла;
КонецЕсли;

Сообщить(ИмяФайла);