ВЫБРАТЬ
 Таблица5.Ресурс,
 Таблица5.Измерение,
 Таблица5.Период,
 Таблица5.Регистратор
ИЗ
(ВЫБРАТЬ
 МАКСИМУМ(Таблица3.Регистратор) КАК Регистратор,
 Таблица3.Измерение
ИЗ
 (ВЫБРАТЬ
  Таблица1.Измерение КАК Измерение,
  МАКСИМУМ(Таблица1.Период) КАК Период
 ИЗ
  РегистрСведений.ПериодическийРегистр КАК Таблица1
ГДЕ
  Таблица1.Период <= &Дата
 СГРУППИРОВАТЬ ПО
  Таблица1.Измерение) КАК Таблица2
  ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПериодическийРегистр КАК Таблица3
  ПО Таблица2.Измерение= Таблица3.Измерение
   И Таблица2.Период = Таблица3.Период
СГРУППИРОВАТЬ ПО
  Таблица3.Измерение) КАК Таблица4
  ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.ПериодическийРегистр КАК Таблица5
  ПО Таблица4.Измерение = Таблица5.Измерение
   И Таблица4.Регистратор = Таблица5.Регистратор
   И Таблица4.Период= Таблица5.Период // Если документ делает два и более движения в разных