//оповещает все созданные формы на клиенте
//если у списка задана основная таблица, то список будет обновлен
ОповеститьОбИзменении(СсылкаНаОбъект);

//Универсальное оповещение
Оповестить("Действие1");
//при это в формах должен быть описан ОтключитьОбработчикОжидания
Процедура ОбработкаОповещения(ИмяСобытия,Параметр,Источник)
	
	Если ИмяСобытия = "Действие1" Тогда	
		Элементы.Список.обновить();
	КонецЕсли;

КонецПроцедуры

//так же можно получить коллекцию всех открытых окон, получить формы и обновить содержимое
КоллекцияОкон = ПолучитьОкна();
Для каждого Окно Из КоллекцияОкон Цикл
	Если Окно.Основное Тогда
		продолжить;
	КонецЕсли;

	Форма = окно.ПолучитьСодержимое();
	//и т.д...
КонецЦикла;