
//Простая
ОткрытьФорму("Справочник.Товары.ФормаОбъекта");

//Группы
Параметры = Новый Структура("ЭтоГруппа",Истина);
ОткрытьФорму("Справочник.Товары.ФормаГруппы",Параметры);

//Форма существующего объекта
Параметры = Новый Структура("Ключ",СправочникСсылка);
ОткрытьФорму("Справочник.Товары.ФормаОбъекта",Параметры);

//Открытие без доп параметров
//может иногда делать лишние серверные вызовы
ОткрытьЗначение(СправочникСсылка)

//Позиционирование на строке в дин. списке
//ТекущаяСтрока - параметр расширения формы дин списка
Параметры = Новый Структура("ТекущаяСтрока",СправочникСсылка);
ОткрытьФорму("Справочник.Товары.ФормаСписка",Параметры);

//Открытие дин списка с ОбновитьПовторноИспользуемыеЗначения
УсловияОтбора = Новый Структура("Владелец", СправочникСсылка)
Параметры = Новый Структура("Отбор",УсловияОтбора);
ОткрытьФорму("Справочник.Товары.ФормаСписка",Параметры);

//Сложное заполнение формы
Форма = ПолучитьФорму("Обработка.Редактор.Форма");
Форма.экпортнаяФункцияФормы();
Форма.Открыть();

