/////////////////////////////////////////////////////////////////////////////////////////////////////////////////
////////////////////     СКД В ТабПоле

Процедура ОформитьКолонкуПометка(ИмяТабличнаяЧасть)

ЭлементыФормы[ИмяТабличнаяЧасть].Колонки[“Пометка”].РежимРедактирования = РежимРедактированияКолонки.Непосредственно;
ЭлементыФормы[ИмяТабличнаяЧасть].Колонки[“Пометка”].Данные = “”;
ЭлементыФормы[ИмяТабличнаяЧасть].Колонки[“Пометка”].ДанныеФлажка = “Пометка”;	
ЭлементыФормы[ИмяТабличнаяЧасть].Колонки[“Пометка”].Ширина = 5;

КонецПроцедуры

Процедура ВывестиСхемуВТабличныйДокумент(СхемаКомпоновки,ТабличныйДокумент,Параметры=Неопределено,КомпоновщикНастроек=Неопределено,ВнешниеНаборыДанных= Неопределено,ДанныеРасшифровки = Неопределено)

ТабличныйДокумент.Очистить();
Если КомпоновщикНастроек = Неопределено Тогда	
КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных(СхемаКомпоновки));
КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
Если Параметры<>Неопределено Тогда	
Для каждого Настройка Из Параметры Цикл
КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Настройка.Ключ,настройка.Значение);
КонецЦикла;	
КонецЕсли;	
КонецЕсли;

ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;	
МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки, КомпоновщикНастроек.Настройки, ДанныеРасшифровки, , Тип(“ГенераторМакетаКомпоновкиДанных”)); //

ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,ВнешниеНаборыДанных,ДанныеРасшифровки,Истина);     //ДанныеРасшифровки

ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
ПроцессорВывода.УстановитьДокумент(ТабличныйДокумент); 
ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных);

КонецПроцедуры

Процедура ВывестиСхемуВТабличноеПоле(СхемаКомпоновки,ТабличноеПоле,Параметры = Неопределено,НастройкиПользователя = Неопределено)


Приемник = ТабличноеПоле.Значение;

Если ТипЗнч(Приемник) = Тип(“ДеревоЗначений”) тогда
Приемник.Строки.Очистить();
Иначе
Приемник.Очистить();
КонецЕсли;

//Приемник.Колонки.Очистить();
КомпоновщикНастроек = Новый КомпоновщикНастроекКомпоновкиДанных();
Если НастройкиПользователя <> Неопределено Тогда
КомпоновщикНастроек.ЗагрузитьНастройки(НастройкиПользователя);
Иначе	
КомпоновщикНастроек.ЗагрузитьНастройки(СхемаКомпоновки.НастройкиПоУмолчанию);
КонецЕсли;

Если Параметры <> Неопределено Тогда
Для каждого Настройка Из Параметры Цикл
КомпоновщикНастроек.Настройки.ПараметрыДанных.УстановитьЗначениеПараметра(Настройка.Ключ,настройка.Значение);
КонецЦикла;
КонецЕсли;

КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
МакетКомпоновкиДанных = КомпоновщикМакета.Выполнить(СхемаКомпоновки, КомпоновщикНастроек.Настройки, , , Тип(“ГенераторМакетаКомпоновкиДанныхДляКоллекцииЗначений”));  //

ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновкиДанных,,,Истина); 

ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВКоллекциюЗначений;
ПроцессорВывода.УстановитьОбъект(Приемник); 
ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных, Ложь);

Если НЕ ТабличноеПоле.Колонки.Количество() Тогда
ТабличноеПоле.СоздатьКолонки();
КонецЕсли;	

ТабличноеПоле.ОбновитьСтроки();

КонецПроцедуры

Процедура ИзменениеФлажкаДрева(ТекущаяСтрока,Значение,ИмяФлажка=“Пометка”)

Если ТекущаяСтрока.Строки.Количество() Тогда	
Для каждого Строка Из ТекущаяСтрока.Строки Цикл	 
ИзменениеФлажкаДрева(Строка,Значение,ИмяФлажка);
КонецЦикла; 
ТекущаяСтрока[ИмяФлажка] = Значение;
Иначе
ТекущаяСтрока[ИмяФлажка] = Значение;   
КонецЕсли;

КонецПроцедуры





///////////////////////////////////////////////////////////

СхемаКомпоновкиДанных = ПолучитьМакет(“Макет”); 
Настройки =   СхемаКомпоновкиДанных .НастройкиПоУмолчанию;
КомпоновщикНастроек.Инициализировать(Новый ИсточникДоступныхНастроекКомпоновкиДанных( СхемаКомпоновкиДанных ));
КомпоновщикНастроек .ЗагрузитьНастройки( СхемаКомпоновкиДанных .НастройкиПоУмолчанию);