Функция ИзExcelВТаблицу(ПутьДоExcel, НомерСтраницы = 1, ПерСтрокаЗаголовок = Ложь , ФормаИндикатора = Неопределено)
    Попытка
        Док = ПолучитьCOMОбъект(ПутьДоExcel); 
    Исключение
        Сообщить("Произошла ошибка при обращение к Excel:" + Символы.ПС + ОписаниеОшибки());
        Возврат Неопределено;
    КонецПопытки;       
 
    ЗакрытьФормуИндиктаора = Ложь;  
    Если ФормаИндикатора = Неопределено тогда
        ЗакрытьФормуИндиктаора = Истина;
        ФормаИндикатора = ПолучитьОбщуюФорму("ХодВыполненияОбработкиДанных");       
        ФормаИндикатора.Открыть();  
    КонецЕсли;      
    ФормаИндикатора.КомментарийЗначения = "Загрузка данных из Excel...";
     
    ТЗ = Новый ТаблицаЗначений();   
    Страница = Док.Sheets(НомерСтраницы);
    МакСтрок = Страница.UsedRange.Rows.Count;       // макс. колич. строк
    МакСтолб = Страница.UsedRange.Columns.Count;    // макс. колич. столбцов    
     
    Для Столбец = 1 по МакСтолб цикл
        ИмяСтолбца = "Столбец_"  + Столбец;
        Если ПерСтрокаЗаголовок тогда
            ИмяСтолбца = Страница.Cells(1,Столбец).Value;
            ИмяСтолбца = СокрЛП(ИмяСтолбца);
            ИмяСтолбца = СтрЗаменить(ИмяСтолбца," ","_");
        КонецЕсли;                      
        ТЗ.Колонки.Добавить(ИмяСтолбца, Новый ОписаниеТипов("Строка"));
    КонецЦикла; 
     
    НачальнаяСтрока = 1;    
    Если ПерСтрокаЗаголовок тогда                                       
        НачальнаяСтрока = 2;
    КонецЕсли;          
     
    Для НомСтрока = НачальнаяСтрока по МакСтрок цикл
        СтрТЗ = ТЗ.Добавить();
        Для НомСтолбец = 1 по МакСтолб цикл
            Данные = Страница.Cells(НомСтрока,НомСтолбец).Value;                
            СтрТЗ[НомСтолбец-1] = Данные;
        КонецЦикла;     
         
        ФормаИндикатора.ЭлементыФормы.Индикатор.Значение = НомСтрока/МакСтрок * 100;        
    КонецЦикла;     
     
    Если ЗакрытьФормуИндиктаора тогда
        ФормаИндикатора.Закрыть();
    КонецЕсли;      
     
    Возврат ТЗ; 
КонецФункции    